"%1$@ Card" = "Karta %1$@";

"%1$@ Credit" = "%1$@ Credit";

"%1$@ Debit" = "%1$@ Debit";

"%1$@ Prepaid" = "%1$@ Prepaid";

"%1$@ account ending in %2$@" = "Kont ta' %1$@ li jintemm biċ-ċifri %2$@";

"%1$@ ending in %2$@" = "%1$@ li jispiċċa %2$@";

"%1$@ is not accepted" = "%1$@ mhix aċċettata";

"Address line 2 (optional)" = "Indirizz linja 2 (mhux obbligatorju)";

"Apple Pay" = "Apple Pay";

"BSB" = "BSB";

"Bank Account" = "Kont bankarju";

"Billing address" = "Indirizz tal-kont";

"Billing details" = "Dettalji tal-ħruġ tal-fatturi";

"CVC" = "CVC";

"Card information" = "L-informazzjoni tal-karta";

"Card number" = "In-numru tal-karta";

"Confirm your %@" = "Ikkonferma l-%@ tiegħek";

"Invalid data." = "Data invalida.";

"MM / YY" = "XX / SS";

"MM/YY" = "XX/SS";

"Postal Code" = "Kodiċi Postali";

"Shipping Address" = "L-Indirizz tat-Trasport tal-Merkanzija";

"State / Province / Region" = "Stat / Provinċja / Reġjun";

"The BSB you entered is invalid." = "Il-BSB li daħħalt mhux validu.";

"The selected brand is not allowed" = "Ix-xorta ta' karta magħżula ma tistax tintuża";

"To scan your card, allow camera access in Settings." = "Biex tiskennja l-karta tiegħek, agħti l-aċċess għall-kamera mill-Għażliet.";

"Your card has expired." = "Il-karta tiegħek skadiet.";

"Your card number is incomplete." = "In-numru tal-karta tiegħek mhux komplut.";

"Your card number is invalid." = "In-numru tal-karta tiegħek mhux tajjeb.";

"Your card's expiration date is incomplete." = "Id-data tal-iskadenza tal-karta tiegħek mhix sħiħa.";

"Your card's expiration date is invalid." = "Id-data tal-iskadenza tal-karta tiegħek mhix tajba.";

"Your card's expiration month is invalid." = "Ix-xahar tal-iskadenza tal-karta tiegħek mhux tajjeb.";

"Your card's expiration year is invalid." = "Is-sena tal-iskadenza tal-karta tiegħek mhix tajba.";

"Your card's security code is incomplete." = "Il-kodiċi tas-sigurtà tal-karta tiegħek mhux komplut.";

"Your card's security code is invalid." = "Il-kodiċi tas-sigurtà tal-karta tiegħek mhux tajjeb.";

"card number" = "in-numru tal-karta";

"example@example.com" = "eżempju@eżempju.com";

"expiration date" = "id-data tal-iskadenza";
